{"sections":{"image_banner_hmRRez":{"type":"image-banner","disabled":true,"settings":{"image":"{{ collection.image }}","image_overlay_opacity":0,"image_height":"small","desktop_content_position":"middle-center","show_text_box":true,"desktop_content_alignment":"center","color_scheme":"background-1","image_behavior":"none","mobile_content_alignment":"center","stack_images_on_mobile":true,"show_text_below":true}},"banner":{"type":"main-collection-banner","settings":{"show_collection_description":true,"show_collection_image":false,"color_scheme":"background-1"}},"product-grid":{"type":"main-collection-product-grid","settings":{"products_per_page":20,"columns_desktop":5,"image_ratio":"square","show_secondary_image":true,"show_vendor":false,"show_rating":true,"enable_quick_add":true,"enable_filtering":true,"filter_type":"horizontal","enable_sorting":true,"columns_mobile":"2","padding_top":36,"padding_bottom":36}},"collapsible_content_cYmXLh":{"type":"collapsible-content","blocks":{"collapsible_row_TjETLm":{"type":"collapsible_row","settings":{"heading":"Free Shipping","icon":"none","row_content":"<p>Free shipping is available on orders over $99 across Canada. This applies to both regular and express shipping (extra costs may apply). The following cities in Quebec and New Brunswick are eligible for express shipping:<\/p><ul><li><strong>Quebec<\/strong>: Quebec City, Montreal, Gatineau, Sherbrooke, Trois-Rivieres, Saguenay, Granby, Laval, Drummondville, Longueuil, Levis, Saint-Hyacinthe<\/li><li><strong>New Brunswick<\/strong>: Moncton, Saint John, Fredericton, Miramichi, Dieppe, Sackville, Oromocto<\/li><\/ul><p>We will use the shipping method available at the time. Some free shipping options may not offer tracking, and no additional insurance is applied to free shipping packages.<\/p><p>At checkout, you can choose from a selection of carriers. We reserve the right to switch carriers if we believe it will result in faster or more cost-effective delivery for Digital Imports.<\/p><p>Free shipping is only available when all items come from the same warehouse. If your items are out of stock at one warehouse and need to be shipped from different locations, we will contact you to arrange for either a replacement item or additional delivery.<\/p>","page":""}},"collapsible_row_LeKPRG":{"type":"collapsible_row","settings":{"heading":"Age Verification","icon":"none","row_content":"<p>We always include the Proof of Age (18+) option with every package.<\/p><p>We use this option for every shipment, so each package will require a signature when it is delivered. If you are not home when delivery is attempted, we will return the package and try to redeliver it later. If we believe that you made a mistake that prevented the delivery (such as wrong address or underage), we may deduct or charge more, even if it is free shipping.<\/p><p>Package costs incurred when packages are returned to the sender due to an inability to identify proof of age will <strong>NOT<\/strong> be reimbursed.<\/p><p>We are unable to delete this option, even if your age has already been validated. In compliance with Canadian law, each shipment leaving our facility will need to have its age verified. Only the individual indicated in the \"Shipping\" fields can pick up the product. The package will <strong>NOT<\/strong> be released to another person by the carrier.<\/p>","page":""}},"collapsible_row_zyWmKX":{"type":"collapsible_row","settings":{"heading":"Next-Day Local Shipping","icon":"none","row_content":"<p>Free Local deliveries are available next-day on orders over CA$50 for the following cities in the GTA and Montreal :<\/p><p>Ajax<br\/>Markham<br\/>Pickering<br\/>Aurora<br\/>Milton<br\/>Richmond Hill<br\/>Bramptom<br\/>Mississauga<br\/>Scarborough<br\/>Burlington<br\/>Newmarket<br\/>Toronto<br\/>Coleraine<br\/>North York<br\/>Vaughan<br\/>Courtice<br\/>Oakville<br\/>Whitby<br\/>Hamilton<br\/>Oshawa<\/p><p>Montreal<\/p>","page":""}},"collapsible_row_yXkUHM":{"type":"collapsible_row","settings":{"heading":"Order Processing and Delivery","icon":"none","row_content":"<p>We handle all orders the same day, and we deliver them within the day you order, as long as you are within our service area (GTA\/Montreal).<\/p><p>In the case of weekends and major holidays, if you receive a tracking number, your order is prepared for shipment, but it is not given to a shipping carrier until the next business day.<\/p><p>In the event that you have any queries or reservations about your order, we have the right to require further time for processing. We will make every effort to contact you by phone or email only if it is absolutely required. During checkout, please make sure you enter your most recent contact information.<\/p><p>Any unexpected incidents or delays caused by weather, we will inform you via phone or email.<\/p>","page":""}},"collapsible_row_H7nKf4":{"type":"collapsible_row","settings":{"heading":"Courier Restriction","icon":"none","row_content":"<p>Most carriers do not deliver packages on Saturday, Sunday, or major holidays.<\/p><p>For shipping, we use UPS and Canada Post.<\/p>","page":""}},"collapsible_row_CtVkgr":{"type":"collapsible_row","settings":{"heading":"Tracking","icon":"none","row_content":"<p>During order processing, tracking numbers are automatically produced when your shipping label is printed. The email address you provide during checkout will thereafter receive an email with the tracking number and the subject \"Your order has shipped!\"<br\/><br\/>If you did not receive a tracking number, please check the \"spam\" folder in your inbox.<br\/><br\/>You can also get all tracking data immediately by signing into \"My Account.\"<\/p>","page":""}},"collapsible_row_GBnyqg":{"type":"collapsible_row","settings":{"heading":"Order Changes and Cancellation","icon":"none","row_content":"<p>Order cancellations and modifications are available. As long as the order hasn't been dispatched yet, please get in touch with us as soon as you can, and we'll try our best to accommodate any adjustments. If your order has been delivered, you must return the package to us before you may receive a refund; shipping fees are not refundable.<br\/><br\/>You can only cancel an order for electronic cigarette liquid (also known as e-juice) if it hasn't been manufactured yet. We are unable to cancel, refund, or credit juice that has already been generated, even if it is still in our facilities, because we normally mix to order.<\/p>","page":""}}},"block_order":["collapsible_row_TjETLm","collapsible_row_LeKPRG","collapsible_row_zyWmKX","collapsible_row_yXkUHM","collapsible_row_H7nKf4","collapsible_row_CtVkgr","collapsible_row_GBnyqg"],"settings":{"caption":"","heading":"Shipping Policy","heading_size":"h1","heading_alignment":"center","layout":"none","color_scheme":"background-1","container_color_scheme":"background-2","open_first_collapsible_row":true,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["image_banner_hmRRez","banner","product-grid","collapsible_content_cYmXLh"]}